dataset_gen/Earlier_Datasets/CE-Gauss_openfoam_irregular/Design_Point_0/0/T
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   nonuniform List<scalar>
16320
(
0.004263118613312124
0.004263118613312124
0.004263118613312124
0.004263118613312124
0.004263118613312124
0.004263118613312124
0.004263118613312124
0.004263118613312124
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
